app/controllers/playlists_controller.rb

  def create
    @playlist = Playlist.new(playlist_params)

    if @playlist.save
---
INSERT INTO "playlists" ("song_title", "artist", "duration", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["song_title", "Cissy Strut"], ["artist", "The Meters"], ["duration", "3:15"], ["created_at", "2020-08-06 14:54:35.330675"], ["updated_at", "2020-08-06 14:54:35.330675"]]

  def update
    if @playlist.update(playlist_params)
---
UPDATE "playlists" SET "song_title" = $1, "artist" = $2, "duration" = $3, "Is_Fave" = $4, "updated_at" = $5 WHERE "playlists"."id" = $6  [["song_title", "Cissy Strut"], ["artist", "The Meters"], ["duration", "3:15"], ["Is_Fave", true], ["updated_at", "2020-08-07 16:20:13.413212"], ["id", 59]]

  def destroy
    @playlist.destroy
---
DELETE FROM "playlists" WHERE "playlists"."id" = $1  [["id", 59]]